<a href="https://colab.research.google.com/github/tomo302/disk110/blob/master/sample.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

必要なプログラムのインストールと、演習で用いるデータを読み込みます。

以下のコードを順に実行してください。

In [1]:
! pip install ipython-sql==0.3.9
! apt-get install sqlite3

# ipython-sqlの読み込み
%load_ext sql

# SQLiteへの接続
%sql sqlite:///tmp.sqlite3

Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/
Requirement already satisfied: ipython-sql==0.3.9 in /usr/local/lib/python3.7/dist-packages (0.3.9)
Requirement already satisfied: prettytable in /usr/local/lib/python3.7/dist-packages (from ipython-sql==0.3.9) (3.3.0)
Requirement already satisfied: ipython-genutils>=0.1.0 in /usr/local/lib/python3.7/dist-packages (from ipython-sql==0.3.9) (0.2.0)
Requirement already satisfied: six in /usr/local/lib/python3.7/dist-packages (from ipython-sql==0.3.9) (1.15.0)
Requirement already satisfied: ipython>=1.0 in /usr/local/lib/python3.7/dist-packages (from ipython-sql==0.3.9) (5.5.0)
Requirement already satisfied: sqlalchemy>=0.6.7 in /usr/local/lib/python3.7/dist-packages (from ipython-sql==0.3.9) (1.4.36)
Requirement already satisfied: sqlparse in /usr/local/lib/python3.7/dist-packages (from ipython-sql==0.3.9) (0.4.2)
Requirement already satisfied: setuptools>=18.5 in /usr/local/lib/python3.7/dist-packages (from ipython>=1.0->ipython-sql==0.3.9) (57.4.0)
Requirement already satisfied: prompt-toolkit<2.0.0,>=1.0.4 in /usr/local/lib/python3.7/dist-packages (from ipython>=1.0->ipython-sql==0.3.9) (1.0.18)
Requirement already satisfied: decorator in /usr/local/lib/python3.7/dist-packages (from ipython>=1.0->ipython-sql==0.3.9) (4.4.2)
Requirement already satisfied: pexpect in /usr/local/lib/python3.7/dist-packages (from ipython>=1.0->ipython-sql==0.3.9) (4.8.0)
Requirement already satisfied: pygments in /usr/local/lib/python3.7/dist-packages (from ipython>=1.0->ipython-sql==0.3.9) (2.6.1)
Requirement already satisfied: simplegeneric>0.8 in /usr/local/lib/python3.7/dist-packages (from ipython>=1.0->ipython-sql==0.3.9) (0.8.1)
Requirement already satisfied: traitlets>=4.2 in /usr/local/lib/python3.7/dist-packages (from ipython>=1.0->ipython-sql==0.3.9) (5.1.1)
Requirement already satisfied: pickleshare in /usr/local/lib/python3.7/dist-packages (from ipython>=1.0->ipython-sql==0.3.9) (0.7.5)
Requirement already satisfied: wcwidth in /usr/local/lib/python3.7/dist-packages (from prompt-toolkit<2.0.0,>=1.0.4->ipython>=1.0->ipython-sql==0.3.9) (0.2.5)
Requirement already satisfied: importlib-metadata in /usr/local/lib/python3.7/dist-packages (from sqlalchemy>=0.6.7->ipython-sql==0.3.9) (4.11.4)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.7/dist-packages (from sqlalchemy>=0.6.7->ipython-sql==0.3.9) (1.1.2)
Requirement already satisfied: zipp>=0.5 in /usr/local/lib/python3.7/dist-packages (from importlib-metadata->sqlalchemy>=0.6.7->ipython-sql==0.3.9) (3.8.0)
Requirement already satisfied: typing-extensions>=3.6.4 in /usr/local/lib/python3.7/dist-packages (from importlib-metadata->sqlalchemy>=0.6.7->ipython-sql==0.3.9) (4.2.0)
Requirement already satisfied: ptyprocess>=0.5 in /usr/local/lib/python3.7/dist-packages (from pexpect->ipython>=1.0->ipython-sql==0.3.9) (0.7.0)
Reading package lists... Done
Building dependency tree
Reading state information... Done
The following package was automatically installed and is no longer required:
  libnvidia-common-460
Use 'apt autoremove' to remove it.
Suggested packages:
  sqlite3-doc
The following NEW packages will be installed:
  sqlite3
0 upgraded, 1 newly installed, 0 to remove and 45 not upgraded.
Need to get 753 kB of archives.
After this operation, 2,483 kB of additional disk space will be used.
Get:1 http://archive.ubuntu.com/ubuntu bionic-updates/main amd64 sqlite3 amd64 3.22.0-1ubuntu0.5 [753 kB]
Fetched 753 kB in 2s (446 kB/s)
Selecting previously unselected package sqlite3.
(Reading database ... 155632 files and directories currently installed.)
Preparing to unpack .../sqlite3_3.22.0-1ubuntu0.5_amd64.deb ...
Unpacking sqlite3 (3.22.0-1ubuntu0.5) ...
Setting up sqlite3 (3.22.0-1ubuntu0.5) ...
Processing triggers for man-db (2.8.3-2ubuntu0.1) ...

'Connected: @tmp.sqlite3'

In [2]:
%%writefile users.tsv
1	Alice	1991-08-31	2008-10-10
2	Bob	1992-03-12	2008-11-02
3	Charlie	1999-09-04	2011-12-28
4	Dave	2001-03-21	2015-09-11
5	Eve	1977-08-14	2009-10-07
6	Frank	1989-10-25	2010-04-17

Writing users.tsv

In [3]:
%%writefile sales_log.tsv
1	1	250	2022-04-19 12:34:23
2	3	320	2022-04-19 14:29:31
3	4	110	2022-04-19 22:40:28
4	5	100	2022-04-20 17:52:53
5	7	900	2022-04-21 09:50:19
6	2	320	2022-04-21 18:07:30
7	1	200	2022-04-22 07:25:51
8	2	310	2022-04-22 11:58:20
9	1	210	2022-04-23 08:11:07
10	1	350	2022-04-23 23:37:55
11	3	100	2022-04-24 10:17:39
12	2	50	2022-04-24 23:49:46
13	7	90	2022-04-25 01:43:34
14	5	1000	2022-04-25 18:14:53
15	1	1000	2022-04-26 06:11:53
16	2	90	2022-04-26 23:41:37
17	3	320	2022-04-27 12:48:31
18	2	1000	2022-04-27 20:19:28
19	1	1000	2022-04-28 16:49:37

Writing sales_log.tsv

In [4]:
%%sql
drop table if exists users;
drop table if exists sales_log;
create table users (user_id INT, name TEXT, born_at TEXT, register_at TEXT);
create table sales_log (sales_id INT, user_id INT, sales INT, sold_at TEXT);

 * sqlite:///tmp.sqlite3
Done.
Done.
Done.
Done.

[]

In [5]:
!sqlite3 -separator $'\t' ./tmp.sqlite3 ".import ./users.tsv users"
!sqlite3 -separator $'\t' ./tmp.sqlite3 ".import ./sales_log.tsv sales_log"

# 演習の前に

## 演習の準備

In [6]:
%%sql
SELECT 42;

 * sqlite:///tmp.sqlite3
Done.

[(42,)]

# 基本操作

### セミコロン

In [7]:
%%sql
SELECT 42; SELECT 24;

 * sqlite:///tmp.sqlite3
Done.
Done.

[(24,)]

### 改行と空白

In [8]:
%%sql
SELECT 42+25 col;

 * sqlite:///tmp.sqlite3
Done.

[(67,)]

In [9]:
%%sql
SELECT 
  42
       +

  25
  col
;

 * sqlite:///tmp.sqlite3
Done.

[(67,)]

### コメント

In [10]:
%%sql
-- コメント
SELECT 42 col -- コメント
/* コメント
コメント
*/
;

 * sqlite:///tmp.sqlite3
Done.

[(42,)]

### 大文字と小文字

In [11]:
%%sql
SELECT * FROM USERS;

 * sqlite:///tmp.sqlite3
Done.

[(1, 'Alice', '1991-08-31', '2008-10-10'),
 (2, 'Bob', '1992-03-12', '2008-11-02'),
 (3, 'Charlie', '1999-09-04', '2011-12-28'),
 (4, 'Dave', '2001-03-21', '2015-09-11'),
 (5, 'Eve', '1977-08-14', '2009-10-07'),
 (6, 'Frank', '1989-10-25', '2010-04-17')]

In [12]:
%%sql
select * from users;

 * sqlite:///tmp.sqlite3
Done.

[(1, 'Alice', '1991-08-31', '2008-10-10'),
 (2, 'Bob', '1992-03-12', '2008-11-02'),
 (3, 'Charlie', '1999-09-04', '2011-12-28'),
 (4, 'Dave', '2001-03-21', '2015-09-11'),
 (5, 'Eve', '1977-08-14', '2009-10-07'),
 (6, 'Frank', '1989-10-25', '2010-04-17')]

In [13]:
%%sql
SeLeCt * FrOM uSErs;

 * sqlite:///tmp.sqlite3
Done.

[(1, 'Alice', '1991-08-31', '2008-10-10'),
 (2, 'Bob', '1992-03-12', '2008-11-02'),
 (3, 'Charlie', '1999-09-04', '2011-12-28'),
 (4, 'Dave', '2001-03-21', '2015-09-11'),
 (5, 'Eve', '1977-08-14', '2009-10-07'),
 (6, 'Frank', '1989-10-25', '2010-04-17')]

### テーブルの作成 ── CREATE TABLE文

In [14]:
%%sql
CREATE TABLE members
  (id INTEGER, name STRING, age INTEGER);

 * sqlite:///tmp.sqlite3
Done.

[]

In [15]:
%%sql
SELECT * FROM sqlite_master WHERE type = 'table';

 * sqlite:///tmp.sqlite3
Done.

[('table', 'users', 'users', 2, 'CREATE TABLE users (user_id INT, name TEXT, born_at TEXT, register_at TEXT)'),
 ('table', 'sales_log', 'sales_log', 3, 'CREATE TABLE sales_log (sales_id INT, user_id INT, sales INT, sold_at TEXT)'),
 ('table', 'members', 'members', 4, 'CREATE TABLE members\n  (id INTEGER, name STRING, age INTEGER)')]

### データの挿入 ── INSERT文

In [16]:
%%sql
INSERT INTO members VALUES (1, "Alice", 5);

 * sqlite:///tmp.sqlite3
1 rows affected.

[]

In [17]:
%%sql
INSERT INTO members(name, age) VALUES ("Jack", 30);

 * sqlite:///tmp.sqlite3
1 rows affected.

[]

### データの取得 ── SELECT文

In [18]:
%%sql
SELECT * FROM members;

 * sqlite:///tmp.sqlite3
Done.

[(1, 'Alice', 5), (None, 'Jack', 30)]

In [19]:
%%sql
SELECT name FROM members;

 * sqlite:///tmp.sqlite3
Done.

[('Alice',), ('Jack',)]

### データの更新 ── UPDATE文

In [20]:
%%sql
UPDATE members SET age = 20 WHERE id = 1;

 * sqlite:///tmp.sqlite3
1 rows affected.

[]

### データの削除 ── DELETE文

In [21]:
%%sql
DELETE FROM members WHERE id = 1;

 * sqlite:///tmp.sqlite3
1 rows affected.

[]

### テーブルの削除 ── DROP TABLE文

In [22]:
%%sql
DROP TABLE members;

 * sqlite:///tmp.sqlite3
Done.

[]

# データの取得をするSELECT文を使いこなす

## SELECT句

In [23]:
%%sql
SELECT * FROM users;
SELECT user_id, name FROM users;

 * sqlite:///tmp.sqlite3
Done.
Done.

[(1, 'Alice'),
 (2, 'Bob'),
 (3, 'Charlie'),
 (4, 'Dave'),
 (5, 'Eve'),
 (6, 'Frank')]

In [24]:
%%sql
SELECT
  name,
  JULIANDAY(CURRENT_DATE) - JULIANDAY(register_at) AS days_after_registered
FROM users;

 * sqlite:///tmp.sqlite3
Done.

[('Alice', 4985.0),
 ('Bob', 4962.0),
 ('Charlie', 3811.0),
 ('Dave', 2458.0),
 ('Eve', 4623.0),
 ('Frank', 4431.0)]

In [25]:
%%sql
SELECT
  name,
  JULIANDAY(CURRENT_DATE) - JULIANDAY(register_at) days_after_registered
FROM users;

 * sqlite:///tmp.sqlite3
Done.

[('Alice', 4985.0),
 ('Bob', 4962.0),
 ('Charlie', 3811.0),
 ('Dave', 2458.0),
 ('Eve', 4623.0),
 ('Frank', 4431.0)]

## WHERE句

In [26]:
%%sql
SELECT user_id, sales, sales > 300 AS is_over_300
FROM sales_log;

 * sqlite:///tmp.sqlite3
Done.

[(1, 250, 0),
 (3, 320, 1),
 (4, 110, 0),
 (5, 100, 0),
 (7, 900, 1),
 (2, 320, 1),
 (1, 200, 0),
 (2, 310, 1),
 (1, 210, 0),
 (1, 350, 1),
 (3, 100, 0),
 (2, 50, 0),
 (7, 90, 0),
 (5, 1000, 1),
 (1, 1000, 1),
 (2, 90, 0),
 (3, 320, 1),
 (2, 1000, 1),
 (1, 1000, 1)]

In [27]:
%%sql
SELECT user_id, sales, sales > 300 AS is_over_300
FROM sales_log
WHERE sales > 300;

 * sqlite:///tmp.sqlite3
Done.

[(3, 320, 1),
 (7, 900, 1),
 (2, 320, 1),
 (2, 310, 1),
 (1, 350, 1),
 (5, 1000, 1),
 (1, 1000, 1),
 (3, 320, 1),
 (2, 1000, 1),
 (1, 1000, 1)]

## FROM句

In [28]:
%%sql
SELECT * FROM users;

 * sqlite:///tmp.sqlite3
Done.

[(1, 'Alice', '1991-08-31', '2008-10-10'),
 (2, 'Bob', '1992-03-12', '2008-11-02'),
 (3, 'Charlie', '1999-09-04', '2011-12-28'),
 (4, 'Dave', '2001-03-21', '2015-09-11'),
 (5, 'Eve', '1977-08-14', '2009-10-07'),
 (6, 'Frank', '1989-10-25', '2010-04-17')]

### 副問合せ

In [29]:
%%sql
SELECT *
FROM (
  SELECT * FROM users WHERE user_id > 5
) AS t;

 * sqlite:///tmp.sqlite3
Done.

[(6, 'Frank', '1989-10-25', '2010-04-17')]

In [ ]:
%%sql
WITH t AS (
  SELECT * FROM users WHERE user_id > 5
)
SELECT * FROM t;

## JOIN演算

### INNER JOIN

In [30]:
%%sql
SELECT
  s.sales_id, s.user_id, s.sales, s.sold_at, u.name
FROM sales_log AS s
INNER JOIN users AS u ON s.user_id = u.user_id;

 * sqlite:///tmp.sqlite3
Done.

[(1, 1, 250, '2022-04-19 12:34:23', 'Alice'),
 (2, 3, 320, '2022-04-19 14:29:31', 'Charlie'),
 (3, 4, 110, '2022-04-19 22:40:28', 'Dave'),
 (4, 5, 100, '2022-04-20 17:52:53', 'Eve'),
 (6, 2, 320, '2022-04-21 18:07:30', 'Bob'),
 (7, 1, 200, '2022-04-22 07:25:51', 'Alice'),
 (8, 2, 310, '2022-04-22 11:58:20', 'Bob'),
 (9, 1, 210, '2022-04-23 08:11:07', 'Alice'),
 (10, 1, 350, '2022-04-23 23:37:55', 'Alice'),
 (11, 3, 100, '2022-04-24 10:17:39', 'Charlie'),
 (12, 2, 50, '2022-04-24 23:49:46', 'Bob'),
 (14, 5, 1000, '2022-04-25 18:14:53', 'Eve'),
 (15, 1, 1000, '2022-04-26 06:11:53', 'Alice'),
 (16, 2, 90, '2022-04-26 23:41:37', 'Bob'),
 (17, 3, 320, '2022-04-27 12:48:31', 'Charlie'),
 (18, 2, 1000, '2022-04-27 20:19:28', 'Bob'),
 (19, 1, 1000, '2022-04-28 16:49:37', 'Alice')]

In [31]:
%%sql
SELECT
  s.sales_id, s.user_id, s.sales, s.sold_at, u.name 
FROM sales_log AS s
INNER JOIN users AS u USING (user_id);

 * sqlite:///tmp.sqlite3
Done.

[(1, 1, 250, '2022-04-19 12:34:23', 'Alice'),
 (2, 3, 320, '2022-04-19 14:29:31', 'Charlie'),
 (3, 4, 110, '2022-04-19 22:40:28', 'Dave'),
 (4, 5, 100, '2022-04-20 17:52:53', 'Eve'),
 (6, 2, 320, '2022-04-21 18:07:30', 'Bob'),
 (7, 1, 200, '2022-04-22 07:25:51', 'Alice'),
 (8, 2, 310, '2022-04-22 11:58:20', 'Bob'),
 (9, 1, 210, '2022-04-23 08:11:07', 'Alice'),
 (10, 1, 350, '2022-04-23 23:37:55', 'Alice'),
 (11, 3, 100, '2022-04-24 10:17:39', 'Charlie'),
 (12, 2, 50, '2022-04-24 23:49:46', 'Bob'),
 (14, 5, 1000, '2022-04-25 18:14:53', 'Eve'),
 (15, 1, 1000, '2022-04-26 06:11:53', 'Alice'),
 (16, 2, 90, '2022-04-26 23:41:37', 'Bob'),
 (17, 3, 320, '2022-04-27 12:48:31', 'Charlie'),
 (18, 2, 1000, '2022-04-27 20:19:28', 'Bob'),
 (19, 1, 1000, '2022-04-28 16:49:37', 'Alice')]

### LEFT OUTER JOIN

In [32]:
%%sql
SELECT
  s.sales_id, s.user_id, s.sales, s.sold_at, u.name 
FROM sales_log AS s
LEFT OUTER JOIN users AS u
ON s.user_id = u.user_id;

 * sqlite:///tmp.sqlite3
Done.

[(1, 1, 250, '2022-04-19 12:34:23', 'Alice'),
 (2, 3, 320, '2022-04-19 14:29:31', 'Charlie'),
 (3, 4, 110, '2022-04-19 22:40:28', 'Dave'),
 (4, 5, 100, '2022-04-20 17:52:53', 'Eve'),
 (5, 7, 900, '2022-04-21 09:50:19', None),
 (6, 2, 320, '2022-04-21 18:07:30', 'Bob'),
 (7, 1, 200, '2022-04-22 07:25:51', 'Alice'),
 (8, 2, 310, '2022-04-22 11:58:20', 'Bob'),
 (9, 1, 210, '2022-04-23 08:11:07', 'Alice'),
 (10, 1, 350, '2022-04-23 23:37:55', 'Alice'),
 (11, 3, 100, '2022-04-24 10:17:39', 'Charlie'),
 (12, 2, 50, '2022-04-24 23:49:46', 'Bob'),
 (13, 7, 90, '2022-04-25 01:43:34', None),
 (14, 5, 1000, '2022-04-25 18:14:53', 'Eve'),
 (15, 1, 1000, '2022-04-26 06:11:53', 'Alice'),
 (16, 2, 90, '2022-04-26 23:41:37', 'Bob'),
 (17, 3, 320, '2022-04-27 12:48:31', 'Charlie'),
 (18, 2, 1000, '2022-04-27 20:19:28', 'Bob'),
 (19, 1, 1000, '2022-04-28 16:49:37', 'Alice')]

In [33]:
%%sql
SELECT
  SUM(sales) AS total_sales, COUNT(*) AS sales_count
FROM sales_log;

 * sqlite:///tmp.sqlite3
Done.

[(7720, 19)]

## 集計関数とGROUP BY句

In [66]:
%%sql
SELECT
  user_id,
  SUM(sales) AS daily_sales,
  COUNT(*) AS daily_sales_count
FROM sales_log
GROUP BY user_id;

 * sqlite:///tmp.sqlite3
Done.

[(1, 3010, 6),
 (2, 1770, 5),
 (3, 740, 3),
 (4, 110, 1),
 (5, 1100, 2),
 (7, 990, 2)]

## ORDER BY句

In [35]:
%%sql
SELECT user_id, name, register_at
FROM users
ORDER BY register_at DESC;

 * sqlite:///tmp.sqlite3
Done.

[(4, 'Dave', '2015-09-11'),
 (3, 'Charlie', '2011-12-28'),
 (6, 'Frank', '2010-04-17'),
 (5, 'Eve', '2009-10-07'),
 (2, 'Bob', '2008-11-02'),
 (1, 'Alice', '2008-10-10')]

In [36]:
%%sql
SELECT
  user_id,
  SUM(sales) AS user_sales
FROM sales_log
GROUP BY user_id
ORDER BY user_sales DESC;

 * sqlite:///tmp.sqlite3
Done.

[(1, 3010), (2, 1770), (5, 1100), (7, 990), (3, 740), (4, 110)]

In [37]:
%%sql
SELECT SUBSTR(sold_at, 1, 10) AS date, sales
FROM sales_log
ORDER BY SUBSTR(sold_at, 1, 10), sales DESC;

 * sqlite:///tmp.sqlite3
Done.

[('2022-04-19', 320),
 ('2022-04-19', 250),
 ('2022-04-19', 110),
 ('2022-04-20', 100),
 ('2022-04-21', 900),
 ('2022-04-21', 320),
 ('2022-04-22', 310),
 ('2022-04-22', 200),
 ('2022-04-23', 350),
 ('2022-04-23', 210),
 ('2022-04-24', 100),
 ('2022-04-24', 50),
 ('2022-04-25', 1000),
 ('2022-04-25', 90),
 ('2022-04-26', 1000),
 ('2022-04-26', 90),
 ('2022-04-27', 1000),
 ('2022-04-27', 320),
 ('2022-04-28', 1000)]

In [38]:
%%sql
SELECT user_id, name, register_at
FROM users
ORDER BY name, user_id, register_at;

 * sqlite:///tmp.sqlite3
Done.

[(1, 'Alice', '2008-10-10'),
 (2, 'Bob', '2008-11-02'),
 (3, 'Charlie', '2011-12-28'),
 (4, 'Dave', '2015-09-11'),
 (5, 'Eve', '2009-10-07'),
 (6, 'Frank', '2010-04-17')]

In [39]:
%%sql
SELECT user_id, name, register_at
FROM users
ORDER BY 2, 1, 3;

 * sqlite:///tmp.sqlite3
Done.

[(1, 'Alice', '2008-10-10'),
 (2, 'Bob', '2008-11-02'),
 (3, 'Charlie', '2011-12-28'),
 (4, 'Dave', '2015-09-11'),
 (5, 'Eve', '2009-10-07'),
 (6, 'Frank', '2010-04-17')]

### LIMIT句

In [40]:
%%sql
SELECT *
FROM sales_log
LIMIT 5;

 * sqlite:///tmp.sqlite3
Done.

[(1, 1, 250, '2022-04-19 12:34:23'),
 (2, 3, 320, '2022-04-19 14:29:31'),
 (3, 4, 110, '2022-04-19 22:40:28'),
 (4, 5, 100, '2022-04-20 17:52:53'),
 (5, 7, 900, '2022-04-21 09:50:19')]

In [41]:
%%sql
SELECT *
FROM sales_log
ORDER BY sales DESC
LIMIT 5;

 * sqlite:///tmp.sqlite3
Done.

[(14, 5, 1000, '2022-04-25 18:14:53'),
 (15, 1, 1000, '2022-04-26 06:11:53'),
 (18, 2, 1000, '2022-04-27 20:19:28'),
 (19, 1, 1000, '2022-04-28 16:49:37'),
 (5, 7, 900, '2022-04-21 09:50:19')]

## 式

### 演算子

In [42]:
%%sql
SELECT * 
FROM users
WHERE user_id BETWEEN 3 AND 5;

 * sqlite:///tmp.sqlite3
Done.

[(3, 'Charlie', '1999-09-04', '2011-12-28'),
 (4, 'Dave', '2001-03-21', '2015-09-11'),
 (5, 'Eve', '1977-08-14', '2009-10-07')]

In [43]:
%%sql
SELECT * 
FROM users
WHERE user_id IN (3, 4, 5);

 * sqlite:///tmp.sqlite3
Done.

[(3, 'Charlie', '1999-09-04', '2011-12-28'),
 (4, 'Dave', '2001-03-21', '2015-09-11'),
 (5, 'Eve', '1977-08-14', '2009-10-07')]

### 関数

In [44]:
%%sql
SELECT SUBSTR(sold_at, 1, 10) AS date, sales
FROM sales_log;

 * sqlite:///tmp.sqlite3
Done.

[('2022-04-19', 250),
 ('2022-04-19', 320),
 ('2022-04-19', 110),
 ('2022-04-20', 100),
 ('2022-04-21', 900),
 ('2022-04-21', 320),
 ('2022-04-22', 200),
 ('2022-04-22', 310),
 ('2022-04-23', 210),
 ('2022-04-23', 350),
 ('2022-04-24', 100),
 ('2022-04-24', 50),
 ('2022-04-25', 90),
 ('2022-04-25', 1000),
 ('2022-04-26', 1000),
 ('2022-04-26', 90),
 ('2022-04-27', 320),
 ('2022-04-27', 1000),
 ('2022-04-28', 1000)]

### パターンマッチ

In [47]:
%%sql
SELECT name
FROM users
WHERE name LIKE '%e';

 * sqlite:///tmp.sqlite3
Done.

[('Alice',), ('Charlie',), ('Dave',), ('Eve',)]

In [48]:
%%sql
SELECT name
FROM users
WHERE name REGEXP 'e$';

 * sqlite:///tmp.sqlite3
Done.

[('Alice',), ('Charlie',), ('Dave',), ('Eve',)]

### 条件分岐を表す式

In [49]:
%%sql
SELECT
  *,
  CASE
    WHEN register_at <= "2009-12-31" THEN "早期会員"
    ELSE "一般会員"
  END AS user_class
FROM users;

 * sqlite:///tmp.sqlite3
Done.

[(1, 'Alice', '1991-08-31', '2008-10-10', '早期会員'),
 (2, 'Bob', '1992-03-12', '2008-11-02', '早期会員'),
 (3, 'Charlie', '1999-09-04', '2011-12-28', '一般会員'),
 (4, 'Dave', '2001-03-21', '2015-09-11', '一般会員'),
 (5, 'Eve', '1977-08-14', '2009-10-07', '早期会員'),
 (6, 'Frank', '1989-10-25', '2010-04-17', '一般会員')]

In [51]:
%%sql
SELECT
  COUNT(
    CASE WHEN sales >= 200 THEN 1 END
  ) AS count_gteq_200,
  COUNT(1) AS count
FROM sales_log;

 * sqlite:///tmp.sqlite3
Done.

[(13, 19)]



```
# これはコードとして書式設定されます
```

## 集合演算子

### UNION

In [52]:
%%sql
SELECT *
FROM users
WHERE user_id BETWEEN 2 AND 4
UNION 
SELECT *
FROM users
WHERE user_id BETWEEN 3 AND 5;

 * sqlite:///tmp.sqlite3
Done.

[(2, 'Bob', '1992-03-12', '2008-11-02'),
 (3, 'Charlie', '1999-09-04', '2011-12-28'),
 (4, 'Dave', '2001-03-21', '2015-09-11'),
 (5, 'Eve', '1977-08-14', '2009-10-07')]

In [54]:
%%sql
SELECT *
FROM users
WHERE user_id BETWEEN 2 AND 4
UNION ALL
SELECT *
FROM users
WHERE user_id BETWEEN 3 AND 5;

 * sqlite:///tmp.sqlite3
Done.

[(2, 'Bob', '1992-03-12', '2008-11-02'),
 (3, 'Charlie', '1999-09-04', '2011-12-28'),
 (4, 'Dave', '2001-03-21', '2015-09-11'),
 (3, 'Charlie', '1999-09-04', '2011-12-28'),
 (4, 'Dave', '2001-03-21', '2015-09-11'),
 (5, 'Eve', '1977-08-14', '2009-10-07')]

# データベースの操作

## CREATE TABLE

In [55]:
%%sql
CREATE TABLE new_table (col1 INTEGER);

 * sqlite:///tmp.sqlite3
Done.

[]

In [56]:
%%sql
CREATE TABLE IF NOT EXISTS new_table (col1 INTEGER);

 * sqlite:///tmp.sqlite3
Done.

[]

In [58]:
%%sql
CREATE TABLE adult_users 
(id INTEGER PRIMARY KEY AUTOINCREMENT,
 name TEXT UNIQUE NOT NULL,
 age INTEGER CHECK(age>=18)
);
INSERT INTO adult_users(name, age) VALUES("Mike", 32);
INSERT INTO adult_users(name, age) VALUES("Jack", 26);
INSERT INTO adult_users(name, age) VALUES("Luna", 15);

 * sqlite:///tmp.sqlite3
(sqlite3.OperationalError) table adult_users already exists
[SQL: CREATE TABLE adult_users
(id INTEGER PRIMARY KEY AUTOINCREMENT,
 name TEXT UNIQUE NOT NULL,
 age INTEGER CHECK(age>=18)
);]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [64]:
%%sql
SELECT * FROM adult_users;

 * sqlite:///tmp.sqlite3
Done.

[(1, 'Mike', 32), (2, 'Jack', 26), (3, '中山美穂', 52)]

In [63]:
%%sql
INSERT INTO adult_users(name, age) VALUES("中山美穂", 52);

 * sqlite:///tmp.sqlite3
1 rows affected.

[]